Revit 2024 API
AnalyticalPowerSourceData.TotalConnectedCurrent Property
 The total connected current of the analytical power source.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public double TotalConnectedCurrent { get; }
Visual Basic
Public ReadOnly Property TotalConnectedCurrent As Double
	Get
Visual C++
public:
property double TotalConnectedCurrent {
	double get ();
}
See Also
AnalyticalPowerSourceData Class
Autodesk.Revit.DB.Electrical Namespace